/******************* ОПИСАНИЕ *******************/

/**
 * Имя файла: cmd.h
 * --------------------------------------------------------------------------------|---------------------------------------|
 * Назначение: обработка команд.
 * --------------------------------------------------------------------------------|---------------------------------------|
 * Примечания:
 */


/************ ДИРЕКТИВЫ ПРЕПРОЦЕССОРА ***********/

// Защита от повторного включения заголовочного файла.
#ifndef CMD_H
#define CMD_H


/*--- Включения ---*/

// Из стандартной библиотеки языка Си.
#include <stdio.h>
#include <inttypes.h>
//#include <stdbool.h>
//#include <string.h>
//#include <stdlib.h>
//#include <errno.h>


/*************** ПРОТОТИПЫ ФУНКЦИЙ **************/

void cmd_handle(int32_t connfd, char *buf, uint32_t verbosity_level);
void cmd_extract(char *buf, char *buf_topic, char *buf_cmd, char delim);


#endif  // Защита от повторного включения заголовочного файла.
