/******************* ОПИСАНИЕ *******************/

/**
 * Имя файла: msg_format_check.h
 * ----------------------------------------------------------------------------|---------------------------------------|
 * Назначение: проверка формата сообщения с помощью регулярных выражений.
 * ----------------------------------------------------------------------------|---------------------------------------|
 * Примечания:
 */


/************ ДИРЕКТИВЫ ПРЕПРОЦЕССОРА ***********/

// Защита от повторного включения заголовочного файла.
#ifndef MSG_FORMAT_CHECK_H
#define MSG_FORMAT_CHECK_H


/*--- Прочее ---*/

// Значения, возвращаемые функцией msg_format_check().
#define MSG_FORMAT_CHECK_REGEX_COMP_FAIL 3
#define MSG_FORMAT_CHECK_NO_MATCH        2
#define MSG_FORMAT_CHECK_PARTIAL_MATCH   1
#define MSG_FORMAT_CHECK_MATCH           0


/*************** ПРОТОТИПЫ ФУНКЦИЙ **************/

uint32_t msg_format_check(char *buf, const char *pattern);


#endif  // Защита от повторного включения заголовочного файла.
