/******************* ОПИСАНИЕ *******************/

/**
 * Имя файла: msg_format_check_regex.h
 * ----------------------------------------------------------------------------|---------------------------------------|
 * Назначение: проверка формата сообщения с помощью регулярных выражений.
 * ----------------------------------------------------------------------------|---------------------------------------|
 * Примечания:
 */


/************ ДИРЕКТИВЫ ПРЕПРОЦЕССОРА ***********/

// Защита от повторного включения заголовочного файла.
#ifndef MSG_FORMAT_CHECK_REGEX_H
#define MSG_FORMAT_CHECK_REGEX_H


/*--- Включения ---*/

// Из стандартной библиотеки языка Си.
#include <stdio.h>
#include <inttypes.h>
#include <string.h>

// Из библиотек POSIX.
#include <regex.h>


/*--- Прочее ---*/

// Коды результата.
#define MSG_FORMAT_REGEX_COMP_FAIL 3
#define MSG_FORMAT_NO_MATCH 2
#define MSG_FORMAT_PARTIAL_MATCH 1
#define MSG_FORMAT_MATCH 0


/*************** ПРОТОТИПЫ ФУНКЦИЙ **************/

uint32_t msg_format_check_regex(char *buf, const char *pattern);


#endif  // Защита от повторного включения заголовочного файла.
