/******************* ОПИСАНИЕ *******************/

/**
 * Имя файла: msg_format_regex_check.h
 * ----------------------------------------------------------------------------|---------------------------------------|
 * Назначение: проверка формата сообщения с помощью регулярных выражений.
 * ----------------------------------------------------------------------------|---------------------------------------|
 * Примечания:
 */


/************ ДИРЕКТИВЫ ПРЕПРОЦЕССОРА ***********/

// Защита от повторного включения заголовочного файла.
#ifndef MSG_FORMAT_REGEXP_CHECK_H
#define MSG_FORMAT_REGEXP_CHECK_H


/*--- Включения ---*/

// Из стандартной библиотеки языка Си.
#include <stdio.h>
#include <inttypes.h>
#include <string.h>

// Из библиотек POSIX.
#include <regexp.h>


/*--- Прочее ---*/

#define MSG_FORMAT_MATCH 0
#define MSG_FORMAT_PARTIAL_MATCH 1
#define MSG_FORMAT_NO_MATCH 2
#define MSG_FORMAT_REGEX_COMP_FAIL 3


/*************** ПРОТОТИПЫ ФУНКЦИЙ **************/

uint32_t msg_format_regex_check(char *buf, const char *pattern);


#endif  // Защита от повторного включения заголовочного файла.
