/******************* ОПИСАНИЕ *******************/

/**
 * Имя файла:  timestamp.h
 * ----------------------------------------------------------------------------|---------------------------------------|
 * Назначение: вывод текущей даты и времени (UTC+0) в человекочитаемом формате.
 * ----------------------------------------------------------------------------|---------------------------------------|
 * Примечания:
 */


/************ ДИРЕКТИВЫ ПРЕПРОЦЕССОРА ***********/

// Защита от повторного включения заголовочного файла.
#ifndef TIMESTAMP_H
#define TIMESTAMP_H


/*************** ПРОТОТИПЫ ФУНКЦИЙ **************/

// Вывод в консоль текущей даты и времени (UTC+0) в человекочитаемом формате.
void timestamp_print();


#endif  // Защита от повторного включения заголовочного файла.
